backend-api/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
UPDATE `users` SET `token` = '2b6fc91a1b8a841594cf2eb7a0517e73aaeab723a7d8050698f368fb0dbe2a1d'
WHERE `id` = '1'
---
    public function login()
    {
        $db = \Config\Database::connect();

        $username = $this->request->getJSON()->username ?? '';
        $password = $this->request->getJSON()->password ?? '';

        // Cari user berdasarkan username
        $user = $db->table('users')->where('username', $username)->get()->getRow();

        // Validasi: user tidak ada atau password salah
        // Catatan: Untuk produksi, gunakan password_hash() & password_verify()
        if (!$user || $user->password !== $password) {
            return $this->respond([
                'status'  => 401,
                'message' => 'Username atau password salah!'
            ], 401);
        }

        // Generate token unik menggunakan bin2hex(random_bytes)
        // Token ini dijamin tidak bisa ditebak
        $token = bin2hex(random_bytes(32)); // 64 karakter hex

        // Simpan token ke database (tabel users, kolom token)
        $db->table('users')->where('id', $user->id)->update(['token' => $token]);

UPDATE `users` SET `token` = NULL
WHERE `token` = 'eef4476ef157463c9bd4990252446f97c520d0936eba2851581eee8302019d2c'
---
    public function logout()
    {
        $db = \Config\Database::connect();

        $authHeader = $this->request->getHeaderLine('Authorization');
        $token = substr($authHeader, 7); // Hapus "Bearer " prefix

        // Kosongkan kolom token di database
        $db->table('users')->where('token', $token)->update(['token' => null]);