backend-api/app/Controllers/CategoryController.php

INSERT INTO `categories` (`category_name`) VALUES ('baju')
---
    public function create()
    {
        $db   = \Config\Database::connect();
        $data = $this->request->getJSON(true); // true = return as array

        // Validasi input tidak boleh kosong
        if (empty($data['category_name'])) {
            return $this->respond(['status' => 400, 'message' => 'Nama kategori wajib diisi!'], 400);
        }

        $db->table('categories')->insert([
            'category_name' => $data['category_name'],
        ]);