backend-api/app/Controllers/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `categories`
SELECT SUM(`stock`) AS `stock`
FROM `products`
---
    public function publicSummary()
    {
        $db = \Config\Database::connect();

        $totalProducts   = $db->table('products')->countAllResults();
        $totalCategories = $db->table('categories')->countAllResults();
        $totalStock      = $db->table('products')->selectSum('stock')->get()->getRow()->stock ?? 0;

SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `categories`
SELECT SUM(`stock`) AS `stock`
FROM `products`
---
    public function index()
    {
        $db = \Config\Database::connect();

        // Hitung total produk
        $totalProducts = $db->table('products')->countAllResults();

        // Hitung total kategori
        $totalCategories = $db->table('categories')->countAllResults();

        // Hitung total stok (sum semua kolom stock)
        $totalStock = $db->table('products')->selectSum('stock')->get()->getRow()->stock ?? 0;