backend-api/app/Controllers/ProductController.php

SELECT `p`.*, `c`.`category_name`
FROM `products` `p`
JOIN `categories` `c` ON `c`.`id` = `p`.`category_id`
ORDER BY `p`.`id` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();

        $products = $db->table('products p')
            ->select('p.*, c.category_name')           // Ambil semua kolom produk + nama kategori
            ->join('categories c', 'c.id = p.category_id') // JOIN ke tabel categories
            ->orderBy('p.id', 'DESC')
            ->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `sku` = 'Sku-002-00'
INSERT INTO `products` (`category_id`, `product_name`, `sku`, `stock`, `price`, `supplier`) VALUES ('1', 'Laptop Acer', 'SKU-002-00', 10, 5000000, 'PT.Acer Indonesia')
---
    public function create()
    {
        $db   = \Config\Database::connect();
        $data = $this->request->getJSON(true);

        // Validasi field wajib
        $required = ['category_id', 'product_name', 'sku', 'price'];
        foreach ($required as $field) {
            if (empty($data[$field])) {
                return $this->respond(['status' => 400, 'message' => "Field '{$field}' wajib diisi!"], 400);
            }
        }

        // Cek SKU tidak boleh duplikat
        $existSku = $db->table('products')->where('sku', $data['sku'])->countAllResults();
        if ($existSku > 0) {
            return $this->respond(['status' => 409, 'message' => 'SKU sudah digunakan produk lain!'], 409);
        }

        $db->table('products')->insert([
            'category_id'  => $data['category_id'],
            'product_name' => $data['product_name'],
            'sku'          => strtoupper($data['sku']), // SKU selalu uppercase
            'stock'        => $data['stock'] ?? 0,
            'price'        => $data['price'],
            'supplier'     => $data['supplier'] ?? '',
        ]);

SELECT *
FROM `products`
WHERE `id` = '8'
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `sku` = 'SKU-004-00'
AND `id` != '8'
---
    public function update($id = null)
    {
        $db      = \Config\Database::connect();
        $data    = $this->request->getJSON(true);

        // PERBAIKAN: find() bukan method Query Builder, gunakan where()->get()->getRowArray()
        $product = $db->table('products')->where('id', $id)->get()->getRowArray();

        if (!$product) {
            return $this->failNotFound('Produk tidak ditemukan!');
        }

        // Jika SKU diubah, pastikan tidak bentrok dengan produk lain
        if (!empty($data['sku'])) {
            $existSku = $db->table('products')
                ->where('sku', $data['sku'])
                ->where('id !=', $id)
                ->countAllResults();

UPDATE `products` SET `category_id` = '1', `product_name` = 'Laptop Axio', `sku` = 'SKU-004-00', `stock` = '10', `price` = '6000000.00', `supplier` = 'PT.Axio Malaysia'
WHERE `id` = '8'
---
        if (isset($data['price']))        $updateData['price']        = $data['price'];
        if (isset($data['supplier']))     $updateData['supplier']     = $data['supplier'];

        $db->table('products')->where('id', $id)->update($updateData);