backend-api/app/Controllers/StockHistoryController.php

SELECT `sh`.*, `p`.`product_name`, `p`.`sku`
FROM `stock_history` `sh`
JOIN `products` `p` ON `p`.`id` = `sh`.`product_id`
ORDER BY `sh`.`created_at` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();

        $history = $db->table('stock_history sh')
            ->select('sh.*, p.product_name, p.sku')
            ->join('products p', 'p.id = sh.product_id')
            ->orderBy('sh.created_at', 'DESC')
            ->get()->getResultArray();

SELECT *
FROM `products`
WHERE `id` = '8'
---
    public function create()
    {
        $db   = \Config\Database::connect();
        $data = $this->request->getJSON(true);

        // Validasi field wajib
        if (empty($data['product_id']) || empty($data['type']) || empty($data['quantity'])) {
            return $this->respond(['status' => 400, 'message' => 'product_id, type, dan quantity wajib diisi!'], 400);
        }

        // Validasi nilai type hanya boleh 'in' atau 'out'
        if (!in_array($data['type'], ['in', 'out'])) {
            return $this->respond(['status' => 400, 'message' => "Type harus 'in' atau 'out'!"], 400);
        }

        // Validasi quantity harus positif
        if ($data['quantity'] <= 0) {
            return $this->respond(['status' => 400, 'message' => 'Jumlah harus lebih dari 0!'], 400);
        }

        // PERBAIKAN: find() bukan method Query Builder, gunakan where()->get()->getRowArray()
        $product = $db->table('products')->where('id', $data['product_id'])->get()->getRowArray();

INSERT INTO `stock_history` (`product_id`, `type`, `quantity`, `notes`) VALUES ('8', 'out', 5, 'Penjualan')
---
        }

        // Insert ke tabel stock_history
        $db->table('stock_history')->insert([
            'product_id' => $data['product_id'],
            'type'       => $data['type'],
            'quantity'   => $data['quantity'],
            'notes'      => $data['notes'] ?? '',
        ]);