backend-api/app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        // Ambil header Authorization dari request
        // Format yang diterima: "Bearer <token_string>"
        $authHeader = $request->getHeaderLine('Authorization');

        // Cek apakah header ada dan diawali "Bearer "
        if (!$authHeader || !str_starts_with($authHeader, 'Bearer ')) {
            return response()
                ->setJSON(['status' => 401, 'message' => 'Token tidak ditemukan. Akses ditolak.'])
                ->setStatusCode(401);
        }

        // Ekstrak token-nya saja (hapus prefix "Bearer ")
        $token = substr($authHeader, 7);

        // Cari token di database tabel users
        $db = \Config\Database::connect();
        $user = $db->table('users')->where('token', $token)->get()->getRow();
---
SELECT *
FROM `users`
WHERE `token` = '15d64327c918f0fc489afba719ae186ba47d418ca65a4a0a09fd4d40fcf36ade'